Revit 2024 API
ACADExportOptions.TextTreatment Property
 The text treatment. Deault value is TextTreatment.Exact.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TextTreatment TextTreatment { get; set; }
Visual Basic
Public Property TextTreatment As TextTreatment
	Get
	Set
Visual C++
public:
property TextTreatment TextTreatment {
	TextTreatment get ();
	void set (TextTreatment value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace